<?php
/**
 * Created by PhpStorm.
 * User: artist
 * Date: 2021-05-11
 * Time: 15:22
 */

/*  [5, 1, 9, 11],
    [2, 4, 8, 10],
    [13, 3, 6, 7],
    [15, 14, 12, 16]*/
function rotate(&$matrix)
{
    $len = count($matrix);
    if ($len <= 1) {
        return;
    }
    //上下交换
    //先把数组分成2半
    for ($i = 0; $i < $len / 2; $i++) {
        $tem = $matrix[$i];  //取上面的一半 [0]--5
        $matrix[$i] = $matrix[$len - $i - 1]; //上面的值和对应下面进行交换 [0]--5 = [3]--15
        $matrix[$len - $i - 1] = $tem;  // [3]--15 = 5
    }

// 变成      [
//           [15,14,12,16],
//           [13,3,6,7],
//           [2,4,8,10],
//           [5,1,9,1]
//          ]
    //左右交换
    for ($i = 0; $i < $len; $i++) {
        for ($j = $i + 1; $j < $len; ++$j) {
            $tem = $matrix[$i][$j];             // [0][1] = 14,[0][2] = 12
            $matrix[$i][$j] = $matrix[$j][$i]; // [0][1]--14 = [1][0]--13 ,[0][2]--12 = [2][0] =2
            $matrix[$j][$i] = $tem;            // [1][0]--13 = 14 , [2][0] = 12
        }
    }
//输出:[
 /*       [15,13,2,5],
          [14,3,4,1],
          [12,6,8,9],
          [16,7,10,11]
    ]*/
}

$matrix = [
    [5, 1, 9, 11],
    [2, 4, 8, 10],
    [13, 3, 6, 7],
    [15, 14, 12, 16]
];
//输出：[
/*[15,13,2,5],
  [14,3,4,1],
  [12,6,8,9],
  [16,7,10,11]
]*/
rotate($matrix);
print_r($matrix);