<?php
/**
 * Created by PhpStorm.
 * User: artist
 * Date: 2021-05-11
 * Time: 14:33
 */
/*  ["5","3",".",".","7",".",".",".","."],
    ["6",".",".","1","9","5",".",".","."],
    [".","9","8",".",".",".",".","6","."],
    ["8",".",".",".","6",".",".",".","3"],
    ["4",".",".","8",".","3",".",".","1"],
    ["7",".",".",".","2",".",".",".","6"],
    [".","6",".",".",".",".","2","8","."],
    [".",".",".","4","1","9",".",".","5"],
    [".",".",".",".","8",".",".","7","9"]*/
class Solution {
    public function isValidSudoku(array $sudo) {
        $n = count($sudo);
        $littleSquare = [];
        $col = [];
        $row = [];
        for ($i = 0; $i < $n; $i++) {

            for ($j = 0; $j < $n; $j++) {
                // '.' 跳过
                if ($sudo[$i][$j] == '.') continue;

                // 检查行是否有重复的数字，有的话
                if (isset($row[$i][$sudo[$i][$j]])) {
                    return false;
                } else {
                    $row[$i][$sudo[$i][$j]] = 1;  //这里 =1 不是为了赋值，只是为了数组的形式的 key==》value ，
                                                  //也就是后面的1可以是任何值
                }

                // 检查列
                if (isset($col[$j][$sudo[$i][$j]])) {
                    return false;
                } else {
                    $col[$j][$sudo[$i][$j]] = 1; //这里 =1 不是为了赋值，只是为了数组的形式的 key==》value
                }

                // 检查小正方形,3x3
                if (isset($littleSquare[floor($i / 3)][floor(($j / 3))][$sudo[$i][$j]])) {
                    return false;
                } else {
                    //这里 =1 不是为了赋值，只是为了数组的形式的 key==》value
                    $littleSquare[floor($i / 3)][floor(($j / 3))][$sudo[$i][$j]] = 1;
                }
            }
        }
        return true;
    }
}

$sudo = [
    ["5","3",".",".","7",".",".",".","."],
    ["6",".",".","1","9","5",".",".","."],
    [".","9","8",".",".",".",".","6","."],
    ["8",".",".",".","6",".",".",".","3"],
    ["4",".",".","8",".","3",".",".","1"],
    ["7",".",".",".","2",".",".",".","6"],
    [".","6",".",".",".",".","2","8","."],
    [".",".",".","4","1","9",".",".","5"],
    [".",".",".",".","8",".",".","7","9"]
];

$cls = new Solution();
$r = $cls->isValidSudoku($sudo);
var_dump($r);
